[
  {
    "id": "article_1",
    "platform": "Hashnode",
    "title": "Automating Tasks with Cron Jobs: A Beginner's Guide",
    "desc": "In the world of Linux, automation is the key to efficient system management and maintenance. One of the most powerful tools for task automation is cron, a time-based job scheduler. Whether you need to perform regular backups, clean up logs, or run custom scripts, cron can handle it all. This guide will introduce you to the basics of cron, how to schedule tasks using cron jobs, an example code, and best practices for managing automated tasks.",
    "link": "https://jenilgajjar.hashnode.dev/automating-tasks-with-cron-jobs-a-beginners-guide",
    "date_published": "Jul 4, 2024",
    "read_time": "3",
    "image": "cron-jobs.png"
  },
  {
    "id": "article_2",
    "platform": "Medium",
    "desc": "Embarking on an exhilarating journey with my office colleagues, I had the privilege of attending the highly anticipated JavaScript Conference India 2023 held in Bengaluru. Little did I know that this trip would become a perfect blend of professional growth 📈, technological marvels 🌟, exploring the vibrant city 🏙️, meeting passionate developers from different countries 🌍, and even a memorable first flight experience ✈️.",
    "title": "From Skies to Insights: JavaScript Conference India 2023 and the Spirit of Bengaluru",
    "link": "https://jenilgajjar.medium.com/from-skies-to-insights-javascript-conference-india-2023-and-the-spirit-of-bengaluru-9f9f48c12893",
    "date_published": "Jun 6, 2023",
    "read_time": "5",
    "image": "banglore_conf.png"
  },
  {
    "id": "article_3",
    "platform": "Medium",
    "desc": "The product we developed was named Ayurveda 🌿. Ayurveda is a traditional Indian natural system of medicine that originated in India more than 3,000 years ago. According to Ayurveda, Vata, Pitta, and Kapha are the human body’s three fundamental energies or principles. These three principles are thought to govern all physiological and psychological processes in the body, and they are said to determine a person’s body and overall health.",
    "title": "The Product we built during Hackathon",
    "link": "https://jenilgajjar.medium.com/the-product-we-built-during-hackathon-a2125d057546",
    "date_published": "Feb 11, 2023",
    "read_time": "3",
    "image": "product_hack.png"
  },
  {
    "id": "article_4",
    "platform": "Medium",
    "desc": "In this article, I will share my experience about 36 hours long in-person hackathon organized by Hack This Fall at Karnavati University, Gandhinagar, India from 3rd to 5th February. It was my first external hackathon, and I had a wonderful experience. People came from all over India to participate in the hackathon. Around 506 lucky participants (including me 😁) got selected and formed 144 teams.",
    "title": "My Experience at Hack This Fall 3.0 Hackathon",
    "link": "https://jenilgajjar.medium.com/my-experience-at-hack-this-fall-3-0-hackathon-496c4c899539",
    "date_published": "Feb 11, 2023",
    "read_time": "4",
    "image": "experience_hack.png"
  },
  {
    "id": "article_5",
    "platform": "Medium",
    "desc": "In this medium article, I will show you how to perform basic CRUD operations with the help of Node.js and Express.js. You will also get an idea of project setup in Node.",
    "title": "CRUD operation using Node.js and Express.js",
    "link": "https://jenilgajjar.medium.com/crud-operation-using-node-js-and-express-js-a0d63a2216aa",
    "date_published": "Sep 4, 2022",
    "read_time": "3",
    "image": "crud_op.png"
  },
  {
    "id": "article_6",
    "platform": "Medium",
    "desc": "In this article, we will learn and understand the definition of Inheritance, syntax, different modes of Inheritance, and various types of Inheritance in C++.",
    "title": "Inheritance in CPP",
    "link": "https://jenilgajjar.medium.com/inheritance-in-cpp-584b892568c0",
    "date_published": "Jul 16, 2022",
    "read_time": "4",
    "image": "inheritance_cpp.png"
  },
  {
    "id": "article_7",
    "platform": "Medium",
    "desc": "Hello everyone, this is my first ever article on medium. I have created a Calculator using Vue.js along with Tailwind CSS. I am going to explain the setup of my project and will also explain to you a few things.",
    "title": "Calculator in Vue.js along with Tailwind CSS",
    "link": "https://jenilgajjar.medium.com/calculator-in-vue-js-along-with-tailwind-css-2e670815208d",
    "date_published": "Jul 3, 2022",
    "read_time": "2",
    "image": "calculator_vue.png"
  }
]
