[
  {
    "id": "exp_1",
    "role": "Jr. IoT Engineer",
    "company_name": "Rejig Digital",
    "description": [
      "Designing and developing RESTful APIs using Nest.js to ensure scalability and performance for IoT applications.",
      "Managing and optimizing MySQL databases, including schema design and query performance tuning for large IoT datasets.",
      "Writing Python scripts for automated data insertion and preprocessing, streamlining integration of sensor data into backend systems.",
      "Leading the integration of Angular-based dashboards with backend services, ensuring responsive design and smooth data flow.",
      "Utilizing Git for source code management, implementing branching strategies and resolving complex merge conflicts in collaborative projects."
    ],
    "start_date": "Aug 2025",
    "end_date": "",
    "location": "Ahmedabad",
    "show": true,
    "current": true
  },
  {
    "id": "exp_2",
    "role": "IoT Intern",
    "company_name": "Rejig Digital",
    "description": [
      "Developed IoT applications using Angular, Nest.js, and Node.js for interactive and scalable solutions",
      "Managed Postgresql databases for real-time data handling.",
      "Utilized Git for version control and team coordination."
    ],
    "start_date": "Aug 2024",
    "end_date": "Aug 2025",
    "location": "Ahmedabad",
    "show": true
  },
  {
    "id": "exp_3",
    "role": "Frontend Developer",
    "company_name": "7Span Internet Private Limited",
    "description": [
      "Utilized Tailwind CSS to create visually appealing and responsive web pages that met client requirements.",
      "Coded using JavaScript(Vue.js) to develop features for both mobile and desktop platforms.",
      "Worked closely with UX/UI designers to translate their designs into functional web applications.",
      "Utilized version control systems such as Git to track changes throughout the development process.",
      "Collaborated with back-end developers to improve website functionality and integrate new features."
    ],
    "start_date": "Jun 2022",
    "end_date": "Jul 2023",
    "location": "Ahmedabad",
    "show": true
  },
  {
    "id": "exp_4",
    "role": "Frontend Intern",
    "company_name": "7Span Internet Private Limited",
    "description": [
      "Collaborated with the design team to produce visually consistent and cohesive content across platforms.",
      "Utilized front-end CSS frameworks such as Tailwind for faster development of responsive designs.",
      "Implemented SEO best practices within website structure, improving search engine rankings for target keywords"
    ],
    "start_date": "Jan 2022",
    "end_date": "Apr 2022",
    "location": "Ahmedabad",
    "show": true
  }
]
